In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("./Online_Retail.csv", encoding="windows-1252")
df.head(3)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/10 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/10 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/10 8:26,2.75,17850.0,United Kingdom

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

In [5]:
df["InvoiceDate"] = pd.to_datetime(df["InvoiceDate"])

C:\Users\Usuario iTC\AppData\Local\Temp\ipykernel_10628\3012402086.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df["InvoiceDate"] = pd.to_datetime(df["InvoiceDate"])

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [8]:
# With True value this is gonna be replaced, not just a copy
df.dropna(subset=["InvoiceDate"], inplace=True)

In [11]:
df.set_index("InvoiceDate", inplace=True)

In [14]:
df["Year"] = df.index.year
df["Month"] = df.index.month
df["Day"] = df.index.day
df["WeekDay"] = df.index.weekday
df["Hour"] = df.index.hour

In [17]:
df.iloc[::, 7:]

                     Year  Month  Day  WeekDay  Hour
InvoiceDate
2010-12-01 08:26:00  2010     12    1        2     8
2010-12-01 08:26:00  2010     12    1        2     8
2010-12-01 08:26:00  2010     12    1        2     8
2010-12-01 08:26:00  2010     12    1        2     8
2010-12-01 08:26:00  2010     12    1        2     8
...                   ...    ...  ...      ...   ...
2011-12-09 12:50:00  2011     12    9        4    12
2011-12-09 12:50:00  2011     12    9        4    12
2011-12-09 12:50:00  2011     12    9        4    12
2011-12-09 12:50:00  2011     12    9        4    12
2011-12-09 12:50:00  2011     12    9        4    12

[541909 rows x 5 columns]